//   {
//     make: "Honda",
//     model: "CR-V",
//     type: "suv",
//     amount: 14,
//     price: 24045,
//     onSale: true,
//   }

// Пусть функция getModels возвращает массив моделей (поле model) всех автомобилей.

// Пусть функция makeCarsWithDiscount возвращает новый массив объектов с изменным значением свойства price в зависимости от переданной скидки.

// Пусть функция filterByPrice возвращает массив автомобилей цена которых меньше чем значение параметра threshold.

// Пусть функция getCarsWithDiscount возвращает массив автомобилей свойство onSale которых true.

// Пусть функция getCarsWithType возвращает массив автомобилей тип которых совпадает со значением параметра type.

// Пусть функция sortByAscendingAmount возвращает новый массив автомобилей отсортированный по возврастанию значения свойства amount.

// Пусть функция sortByDescendingPrice возвращает новый массив автомобилей отсортированный по убыванию значения свойства price.

// Пусть функция getTotalAmount возвращает общее количество автомобилей(значение свойств amount).

// Пусть функция getSortedCarsOnSale возвращает массив автомобилей на распродаже (свойство onSale), отсортированных по возрастанию цены.
