/*
 * Функция обратного вызова (callback)
 * - Функция может принимать другие функции как параметры
 * - Функция которая передаётся другой функции как аргумент называетс
 *   «функцией обратного (отложенного) вызова» (callback-функция)
 * - Функция которая принимает другую функцию как параметр
 *   или возвращает функцию как результат своей работы называется «функцией высшего порядка»
 */

/*
 * функция doMath(a, b, callback)
 */

/*
 * Отложенный вызов: регистрация событий
 */

/*
 * Отложенный вызов: интервалы
 */

// ================================================
