/* 
Операція ... (rest) дозволяє зібрати групу незалежних елементів у нову колекцію. Синтаксично - це близнюк операції розподілу, але відрізнити їх просто - розподіл - коли ... знаходиться у правій частині операції присвоювання, а збирання - коли ... знаходиться в її лівій частині.
*/

function foo(...arr) {
  console.log(arr);
}

foo(1, 2, 3, 4, 5, 6, 78, 9, 10);

/* 
Збирання остаточних параметрів
*/

// function foo1(x, y, ...args) {
//   const h = args[args.length - 1];
//   const w = args[args.length - 2];
//   console.log(x, y, args);
// }
// foo1(1, 2, 3, 4, 5, 6, 78, 9, 10);
