/*

    EVERY
 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає true, якщо всі елементи масиву задовiльняють умову.
 - Повертає false, якщо хоча б один елемент масиву не задовiльняє умову.
 - Перебирання масиву припиняється, якщо колбек повертає false.
*/

let array = [3, 6, 10, 12, 16, 29, 29];

const temp = array.every((elem, index, array) => {
  return elem % 3 === 0 || elem % 2 === 0;
});

console.log(temp);

// true && true && false && true;

/*
    SOME
 - Не змінює оригінальний масив.
 - Поелементо перебирає оригінальний масив.
 - Повертає true, якщо хоча б один елемент масиву задовольняє умову.
 - Повертає false, якщо жоден елемент масиву не задовольняє умову.
 - Перебирання масиву припиняється, якщо колбек повертає true.
*/

let array1 = [3, 6, 10, 12, 16, 29, 29, -5];

const result = array1.some((elem, index, array) => {
  return elem < 0;
});

// false || false || false || true || false || false;

console.log(result);
