/* 
Контекст виконання функції
*/

/* 
Правила визначення this
    - this у глобальній області видимості
    - this в методі об'єкта
    - this в callback-функціях
    - this у стрілочних функціях
*/

/* 
1. Який тип функції

- якщо стрілчата, дивимось момент створення (якщо контекст не готовий - дивимось батьківський контектс)

- якщо звичайна, дивимось момент виклику (якщо контекст не готовий - дивимось батьківський контектс)
*/

//- this у callback функціях

//- this у стрілочних функціях

/* 
Методи функцій
    - Метод call()
    - Метод apply()
    - Метод bind()
*/
